export const roles = [
  {
      key: "",
      label: "",
  },
  {
      key: "مدیرعامل",
      label: "مدیرعامل",
  },
  {
      key: "رییس هیئت مدیره",
      label: "رییس هیئت مدیره",
  },
  {
      key: "عضو هیئت مدیره",
      label: "عضو هیئت مدیره",
  },
];

export const saleAmounts = [
  {
    key: "",
    label: "",
  },
  {
    key: "بیش از 100.000 میلیارد ریال",
    label: "بیش از 100.000 میلیارد ریال",
  },
  {
    key: "100.000 - 50.000 میلیارد ریال",
    label: "100.000 - 50.000 میلیارد ریال",
  },
  {
    key: "50.000 - 10.000 میلیارد ریال",
    label: "50.000 - 10.000 میلیارد ریال",
  },
  {
    key: "10.000 - 5000 میلیارد ریال",
    label: "10.000 - 5000 میلیارد ریال",
  },
  {
    key: "5000 - 1000 میلیارد ریال",
    label: "5000 - 1000 میلیارد ریال",
  },
  {
    key: "1000 - 100 میلیارد ریال",
    label: "1000 - 100 میلیارد ریال",
  },
  {
    key: "100 - 50میلیارد ریال",
    label: "100 - 50میلیارد ریال",
  },
  {
    key: "کمتر از 50میلیارد ریال",
    label: "کمتر از 50میلیارد ریال",
  },
];

export const companyActivityFields = [
    {
        type: 1,
        key: "آرایشی بهداشتی، زیبایی، سلامت و دارو",
        label: "آرایشی بهداشتی، زیبایی، سلامت و دارو"
    },
    {
        type: 2,
        key: "برنامه نويسي، مشاوره و فعاليت هاي مربوط به رايانه",
        label: "برنامه نويسي، مشاوره و فعاليت هاي مربوط به رايانه"
    },
    {
        type: 1,
        key: "توليد گياهان و حيوانات، شكار و فعاليتهاي خدماتي وابسته",
        label: "توليد گياهان و حيوانات، شكار و فعاليتهاي خدماتي وابسته"
    },
    {
        type: 2,
        key: "فعاليت هاي مربوط به سلامت انسان",
        label: "فعاليت هاي مربوط به سلامت انسان"
    },
    {
      type: 2,
      key: "جنگلداري و بريدن درختان",
      label: "جنگلداري و بريدن درختان"
    },
    {
      type: 2,
      key: "ماهيگيري و آبزي پروري",
      label: "ماهيگيري و آبزي پروري"
    },
    {
      type: 2,
      key: "استخراج زغال سنگ و زغال قهوه اي",
      label: "استخراج زغال سنگ و زغال قهوه اي"
    },
    {
      type: 2,
      key: "استخراج نفت خام و گاز طبيعي",
      label: "استخراج نفت خام و گاز طبيعي"
    },
    {
      type: 2,
      key: "استخراج كانه هاي فلزي",
      label: "استخراج كانه هاي فلزي"
    },
    {
      type: 2,
      key: "استخراج ساير معادن",
      label: "استخراج ساير معادن"
    },
    {
      type: 2,
      key: "فعاليت هاي خدمات پشتيباني استخراج معدن",
      label: "فعاليت هاي خدمات پشتيباني استخراج معدن"
    },
    {
      type: 2,
      key: "توليد محصولات غذايي",
      label: "توليد محصولات غذايي"
    },
    {
      type: 2,
      key: "توليد انواع آشاميدني ها",
      label: "توليد انواع آشاميدني ها"
    },
    {
      type: 2,
      key: "توليد منسوجات",
      label: "توليد منسوجات"
    },
    {
      type: 2,
      key: "توليد پوشاك",
      label: "توليد پوشاك"
    },
    {
      type: 2,
      key: "توليد چرم و فراورده هاي وابسته",
      label: "توليد چرم و فراورده هاي وابسته"
    },
    {
      type: 2,
      key: "توليد كاغذ و فراورده هاي كاغذي",
      label: "توليد كاغذ و فراورده هاي كاغذي"
    },
    {
      type: 2,
      key: "چاپ و تكثير رسانه هاي ضبط شده",
      label: "چاپ و تكثير رسانه هاي ضبط شده"
    },
    {
      type: 2,
      key: "توليد كك و فراورده هاي حاصل از پالايش نفت",
      label: "توليد كك و فراورده هاي حاصل از پالايش نفت"
    },
    {
      type: 2,
      key: "توليد مواد شيميايي و فراورده هاي شيميايي",
      label: "توليد مواد شيميايي و فراورده هاي شيميايي"
    },
    {
      type: 2,
      key: "توليد داروها و فراورده هاي دارويي شيميايي و گياهي",
      label: "توليد داروها و فراورده هاي دارويي شيميايي و گياهي"
    },
    {
      type: 2,
      key: "توليد فراورده هاي لاستيكي و پلاستيكي",
      label: "توليد فراورده هاي لاستيكي و پلاستيكي"
    },
    {
      type: 2,
      key: "توليد ساير فراورده هاي معدني غيرفلزي",
      label: "توليد ساير فراورده هاي معدني غيرفلزي"
    },
];

export const numberOfEmployeesList = [
  {
      key: "1-9",
      label: "1-9"
  },
  {
      key: "10-49",
      label: "10-49"
  },
  {
    key: "50-99",
    label: "50-99",
  },
  {
    key: "100-199",
    label: "100-199",
  },
  {
    key: "200-299",
    label: "200-299",
  },
  {
    key: "300-399",
    label: "300-399",
  },
  {
    key: "400-499",
    label: "400-499",
  },
  {
    key: "500-999",
    label: "500-999",
  },
  {
    key: "1000-1999",
    label: "1000-1999",
  },
  {
    key: "بیش از 2000",
    label: "بیش از 2000",
  },
];

export const companyTypes = [
    {
        key: "شرکت با مسئولیت محدود",
        label: "شرکت با مسئولیت محدود",
    },
    {
        key: "شرکت سهامی خاص",
        label: "شرکت سهامی خاص",
    }, 
    {
      key: "شرکت تضامنی",
      label: "شرکت تضامنی",
    },
    {
        key: "شرکت نسبی",
        label: "شرکت نسبی",
    },
    {
      key: "شرکت مختلط سهامی",
      label: "شرکت مختلط سهامی",
    },
    {
      key: "شرکت مختلط غیر سهامی",
      label: "شرکت مختلط غیر سهامی",
    },
    {
      key: "شرکت سهامی عام",
      label: "شرکت سهامی عام",
    },
    {
      key: "شرکت تعاونی",
      label: "شرکت تعاونی",
    },
    {
      key: "موسسه غیرتجاری",
      label: "موسسه غیرتجاری",
    },
    {
      key: "شعبه شرکت خارجی",
      label: "شعبه شرکت خارجی",
    }, 
    {
        key: "نمایندگی شرکت خارجی",
        label: "نمایندگی شرکت خارجی",
    }, 
    {
        key: "شرکت تعاونی سهامی عام",
        label: "شرکت تعاونی سهامی عام",
    }, 
    {
        key: "صندوق سرمایه گذاری",
        label: "صندوق سرمایه گذاری",
    }, 
    {
        key: "شعبه موسسه غیرتجاری خارجی",
        label: "شعبه موسسه غیرتجاری خارجی",
    }, 
    {
        key: "نمایندگی موسسه غیرتجاری خارجی",
        label: "نمایندگی موسسه غیرتجاری خارجی",
    },
];


export const DashboardTypeDate = [
  {
    key : "1" , 
    label : "هفته جاری"
  } , 
  {
    key : "2" , 
    label : "هفته جاری"
  } , 
  {
    key : "3" , 
    label : "ماه اخیر 12"
  }
]